app/controllers/boards_controller.rb

  def create
    @board = Board.new(params[:board])

    respond_to do |format|
      if @board.save
---
INSERT INTO "boards" ("name", "kpt_date", "created_at", "updated_at") VALUES ('テスト', '2011-05-21', '2011-05-21 23:03:06.793946', '2011-05-21 23:03:06.793946')